Marks100/STM32_RFM69_receiver/Src/CLI/CLI.c
				strcpy( CLI_msg_read_s, CLI_cmd_history_s.cmd_list[ CLI_cmd_history_s.index_to_next_cmd ].cmd);

				CLI_byte_index_s = strlen( CLI_cmd_history_s.cmd_list[ CLI_cmd_history_s.index_to_next_cmd ].cmd );

				CLI_send_data( (u8_t*)ERASE_CURRENT_LINE, strlen(ERASE_CURRENT_LINE) );

				CLI_print_prompt( FALSE );

				CLI_send_data( CLI_msg_read_s, strlen( CLI_msg_read_s ) );
            }
            return;
        }
        else if( ( received_char == LEFT_ARROW || received_char == RIGHT_ARROW ) && ( CLI_msg_read_s[ CLI_byte_index_s - 1u ] == '[' ) )
        {
        	/* handle the left and right arrow keys aswell, but for now just ignore them */
        	return;
        }
        else if( received_char == '[' )
        {
            CLI_msg_read_s[ CLI_byte_index_s++ ] = received_char;
            return;
        }
        else
        {
            if( CLI_byte_index_s < CLI_MAX_INPUT_CHARS )
            {
            	/* Record every byte that gets received */
            	CLI_msg_read_s[ CLI_byte_index_s++ ] = received_char;
            	CLI_send_data( &received_char, sizeof(received_char) );
            }
        }
    }
}

STATIC void CLI_clear_rx_buffer( void )
{
     STDC_memset( CLI_msg_read_s, 0x00, sizeof( CLI_msg_read_s ) );
     CLI_byte_index_s = 0u;
     CLI_rx_command_len = 0u;
}


STATIC false_true_et CLI_carriage_return_check( void )
{
    false_true_et return_type = FALSE;

    if( CLI_cr_received_s == TRUE )
    {
        return_type = TRUE;
    }
    return ( return_type );
}



STATIC false_true_et CLI_is_space_or_newLine( char c )
{
    false_true_et return_type = FALSE;

    if( (c == ' ') || (c == '\t') || (c == '\r') || (c == '\n') )
    {
        return_type = TRUE;
    }
    return ( return_type );
}


STATIC false_true_et CLI_is_hex_char( char c )
{
    false_true_et return_type = FALSE;

    if( (c >= '0' && c <= '9') || (c >= 'a' && c <= 'f') || (c >= 'A' && c <= 'F') )
    {
        return_type = TRUE;
    }

    return ( return_type );
}

STATIC false_true_et CLI_is_dec_char( char c )
{
    false_true_et return_type = FALSE;

    if( c >= '0' && c <= '9' )
    {
        return_type = TRUE;
    }
    return ( return_type );
}


STATIC unsigned long long CLI_str_to_hex( const char* str )
{
    return (unsigned long long) strtoull(str, 0, 16);
}

void CLI_send_newline( void )
{
    CLI_send_data( CLI_newline, sizeof( CLI_newline ) );
}

void CLI_print_welcome_message( void )
{
    CLI_send_data( CLI_welcome_message_s, sizeof( CLI_welcome_message_s ) );
}

STATIC void CLI_print_prompt( false_true_et newline )
{
    char prompt_string[100u];

    STDC_memset( prompt_string, 0x20, sizeof( prompt_string ) );

    if( newline == TRUE )
    {
    	CLI_send_newline();
    	CLI_send_newline();
    }
    //sprintf(  &prompt_string[ ( newline == TRUE ) ? 2:0 ], ""RED"CLI PROMPT>" );
    sprintf(  prompt_string, "CLI PROMPT>" );

    CLI_send_data( (u8_t*)prompt_string, strlen( prompt_string ) );
}


void CLI_send_data( u8_t* data, u16_t data_size )
{
    HAL_UART_send_data( data, data_size );
}


STATIC CLI_error_et CLI_parse_cmd( char* message_string, u8_t* argumen_count, char **argument_vector, u8_t max_num_args )
{
    CLI_error_et error = CLI_ERROR_NONE;
    char* cmd;
    u8_t calc_argumen_count = 0u;
    u8_t i = 0u;

    cmd = message_string;

    // Search for the first charachter */
    for( i = 0u; i < strlen( message_string ) - 1; i++ )
    {
    	if( CLI_is_space_or_newLine( *(cmd+i) ) != TRUE )
    	{
    		break;
    	}
    }

    /* We have pointed the command to the start of the string ignoring any leading spaces or tabs
     * and because we have found that this charachter was not a space we can immediately move to the next charachter*/

    argument_vector[calc_argumen_count++] = cmd;
    cmd += ( i + 1u );

	for (; *cmd; cmd++)
	{
		if ( CLI_is_space_or_newLine(*cmd) == TRUE )
		{
			*cmd = '\0';
		}
		else if ( *(cmd - 1u) == '\0')
		{
			if( ( calc_argumen_count ) >= max_num_args )
			{
				error = CLI_ERROR_INVALID_ARGS_MORE;
				break;
			}
			argument_vector[calc_argumen_count++] = cmd;
		}
	}

	*argumen_count = calc_argumen_count;

    return error;
}


STATIC CLI_error_et CLI_process_cmd( u8_t  aArgCount, char *aArgVector[] )
{
    CLI_error_et error = CLI_ERROR_NONE;
    const CLI_Command_st *cmd = NULL;

    for ( cmd = CLI_commands; cmd->command_name != NULL; cmd++ )
    {
        if ( (strcmp( aArgVector[0], cmd->command_name ) == 0u ) )
        {
			//the command can be executed. Now get into validating the parameters and their values provided by the user
			error = CLI_ERROR_NONE;
        	//error = DEBUG_CLI_get_cum_validate_cmd_params(cmd, (aArgCount-1), ((aArgCount-1)?&aArgVector[1]:NULL),((aArgCount-1)?val:NULL));
//			}
//			else
//			{
//				error = CLI_ERROR_PROHIBITED;
//			}
			// there is a matching entry in the table. just come out of the loop!
			break;
    	}
    }

    if(cmd->command_name == NULL)
    {
        // looks like we have looped through the entire table and we did not get see the command.
        error = CLI_ERROR_NOT_FOUND;
    }

    if( error == CLI_ERROR_NONE  )
    {
        error = cmd->command_handler((aArgCount-1), aArgVector );
    }

    return error;
}




STATIC CLI_error_et help_handler( u8_t aArgCount, char *aArgVector[] )
{
	char  output_string[250] = { 0 };
	const CLI_Command_st *cmd = NULL;

	CLI_send_newline();

	for ( cmd = CLI_commands; cmd->command_name != NULL; cmd++)
	{
		STDC_memset( output_string, 0x20, sizeof( output_string ) );

		if( strcmp( cmd->command_name,"mode") == 0 )
		{
			sprintf(output_string, cmd->helpinfo);
			CLI_send_data( output_string, strlen(output_string));

			STDC_memset( output_string, 0, sizeof( output_string ) );
			CLI_send_newline();
		}
		else
		{
			sprintf(output_string, "\r\t%s", cmd->helpinfo);
			CLI_send_data( output_string, strlen(output_string));
		}
	}
	CLI_send_newline();
}

STATIC CLI_error_et setmode_handler( u8_t aArgCount, char *aArgVector[] )
{

